app/views/user_books/_form.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."username" ASC
---
    <%= form.label :user_id, style: "display: block" %>
    <%= form.select :user_id, User.order(:username).map { |user| [user.username, user.id] },
    include_blank: true, id: "id_of_the_user_id_select_box" %>

SELECT "books".* FROM "books" ORDER BY "books"."name" ASC
---
    <%= form.label :book_id, style: "display: block" %>
    <%= form.select :book_id, Book.order(:name).map { |book| [book.name, book.id] },
     include_blank: true, id: "id_of_the_book_id_select_box" %>