app/controllers/books_controller.rb

  def index
    # @page = params[:page].to_i
    @books = Book.order(:id)
---
SELECT "books".* FROM "books" ORDER BY "books"."id" ASC

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("name", "description", "created_at", "updated_at", "category_id", "author", "price") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", ""], ["description", "Hello"], ["created_at", "2023-09-05 23:35:08.160543"], ["updated_at", "2023-09-05 23:35:08.160543"], ["category_id", nil], ["author", "Hello"], ["price", 12]]

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "description" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["description", "The first book in this magical series by J.K Rowling."], ["updated_at", "2023-09-05 22:20:16.024465"], ["id", 1]]